use test;
insert into tbl_posts values
(8,'英雄难过美人关','英雄也是人，也有七情六欲，逃不过情爱，难过美人关','2018-4-8 00:00:01','2018-4-8 00:15:37',6),
(9,'每个人都想成为英雄','想要成为英雄，就必须有常人所没有的胆识和气魄','2018-4-6 10:00:41','2018-4-7 20:19:47',5)

--创建一条帖子的评论并更新帖子的updatetime时间（使用事务）
use test;
begin; 
insert into tbl_posts_comments values
(9,'再见',now(),4,6);
update tbl_posts p set p.pUpdateTime=now() where p.pId=6;
commit; 

-----test1数据库
---向用户表中插入数据
use test1;
select * from tbl_user;
insert into tbl_user values
(1,'张三',18,'18720961152',24,1),
(2,'李四',27,'15478942356',10,2),
(3,'李红',20,'14785210136',50,1),
(4,'王娟',29,'15324895678',30,2),
(5,'陈明',19,'15465489521',32,1),
(6,'白华',22,'13658748974',55,2),
(7,'刘娟',25,'15845671236',31,1),
(8,'黄丽',23,'14589675213',21,2);


--向帖子表插入数据
use test1;
select * from tbl_dynamic
insert into tbl_dynamic values
(1,'中国与美国各自提高相应物品的税率。',1,'2018-4-2 18:59:54'),
(2,'多益网络公司即将在广州科学城建立总部大厦，并于近日举行奠基仪式。',2,'2018-3-27 20:24:30'),
(3,'多益网络将于本周末在羽毛球馆举行嘉年华活动，现场可抽奖哦！',3,'2018-3-29 11:50:24'),
(4,'公司清明节放假时间为4月5日-4月7日,４月８日（周日）调休上班。',4,'2018-4-5 16:54:54'),
(5,'李娟我喜欢你，＠李娟',1,'2018-2-14 00:01:27'),
(6,'我们就走到这吧，＠李红',1,'2018-4-1 00:41:07'),
(7,'六一儿童节放假一天，第二天正常上班！',3,date(now())),
(8,'大家好，介绍一下，我的女朋友！',1,date(now())),
(9,'大家好，介绍一下，我的女朋友！',1,date(now())),
(10,'大家好，介绍一下，我的男朋友！',1,date(now())),
(11,'大家好，介绍一下，我的朋友！',1,date(now()));


--向评论表插入数据
use test1;
select * from tbl_comment
insert into tbl_comment values
(1,'好样的',now(),2,1),
(2,'中国加油！',now(),3,1),
(3,'我想去我想去',now(),1,3),
(4,'各位小姐姐，约吗？',now(),4,4),
(5,'希望多益越来越好',now(),2,2),
(6,'在一起！',now(),2,5),
(7,'好聚好散',now(),1,6),
(8,'祝福！',now(),7,8),
(9,'好帅啊！',now(),8,10),
(10,'可以的，很秀',now(),1,11);


