/*
 * @Author: mikey.zhaopeng 
 * @Date: 2018-04-26 10:15:55 
 * @Last Modified by: mikey.zhaopeng
 * @Last Modified time: 2018-04-26 19:48:23
 */
'use strict';

const eNet = {
    '广州内网' : 0,
    '广州中网' : 1,
    '广州外网' : 2,
    '成都内网' : 3,
    '成都中网' : 4,
    '成都外网' : 5,
    '三网通' : 6,
    '未知' : 0
};

const allNet = [
    '172.16.16.*'
];

//广州内网
const gzInSideIps = [
    //广州内网PC段
    '10.17.0.0/19',
    //广州内网服务器段
    '10.17.64.0/23',
    '10.17.72.0/21',
    '192.168.180.0/22',
    '192.168.184.0/22',
    '192.168.191.0/24',
];

//成都内网
const cdInSideIps = [
    //成都内网PC段
    '192.168.108.0/23',
    //成都内网服务器段
    '192.168.111.0/24',
    '192.168.112.0/23'
];

//广州中网
const gzMiddleIps = [
    //广州中网PC段
    '10.16.0.0/19',
    //广州中网服务器段
    '10.16.64.0/23',
    '10.16.72.0/21',
    '192.168.127.0/24',
    '192.168.167.0/24'
];

//成都中网
const cdMiddleIps = [
    //成都中网PC段
    '192.168.104.0/23',
    //成都中网服务器段
    '192.168.106.0/23'
];

//广州外网
const gzOutSideIps = [
    //广州外网PC段
    '10.32.0.0/19',
    //广州外网服务器段
    '10.32.64.0/23',
    '10.32.72.0/21',
    '192.168.131.0/24',
    '192.168.161.0/24',
    '192.168.165.0/24',
    //广州无线段
    '10.5.0.0/16',
    '10.5.63.0/24'
]

//成都外网
const cdOutSizeIps = [
    //成都外网PC段
    '192.168.90.0/23',
    '192.168.96.0/23',
    //成都外网服务器段
    '192.168.98.0/23',
    //成都无线段
    '192.168.92.0/22'
];

module.exports = {
    eNet,
    allNet,
    gzInSideIps,
    cdInSideIps,
    gzMiddleIps,
    cdMiddleIps,
    gzOutSideIps,
    cdOutSizeIps
}