
--向用户表插入数据
insert into tbl_user values
(1,'张三',18,'18720961152',24,1),
(2,'李四',27,'15478942356',10,2),
(3,'李红',20,'14785210136',50,1),
(4,'王娟',29,'15324895678',30,2),
(5,'陈明',19,'15465489521',32,1),
(6,'白华',22,'13658748974',55,2);

--向帖子表插入数据
insert into tbl_posts values
(1,'中美贸易站已打响','中国与美国各自提高相应物品的税率。','2018-4-2 18:52:21','2018-4-2 18:59:54',1),
(2,'多益网络大厦总部举行奠基仪式','多益网络公司即将在广州科学城建立总部大厦，并于近日举行奠基仪式。','2018-3-26 10:42:01','2018-3-27 20:24:30',2),
(3,'多益网络邀你参加嘉年华，以游会友','多益网络将于本周末在羽毛球馆举行嘉年华活动，现场可抽奖哦！','2018-3-28 9:57:41','2018-3-29 11:50:24',3),
(4,'清明节放假通知','公司清明节放假时间为4月5日-4月7日,４月８日（周日）调休上班。','2018-4-5 15:42:20','2018-4-5 16:54:54',4),
(5,'强势表白','李娟我喜欢你，＠李娟','2018-2-14 00:00:21','2018-2-14 00:01:27',1),
(6,'对不起，再见','我们就走到这吧，＠李红','2018-4-1 00:10:41','2018-4-1 00:41:07',1),
(7,'六一儿童节快乐','六一儿童节放假一天，第二天正常上班！',date(now()),date(now()),3);

--向评论表插入数据
insert into tbl_posts_comments values
(1,'好样的',now(),2,1),
(2,'中国加油！',now(),3,1),
(3,'我想去我想去',now(),1,3),
(4,'各位小姐姐，约吗？',now(),4,4),
(5,'希望多益越来越好',now(),2,2),
(6,'在一起！',now(),2,5),
(7,'好聚好散',now(),1,6);

--向帖子＠用户表中插入数据
insert into tbl_at_user values
(1,4,5),
(2,3,6);
